Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/social_welfare/irish_social_welfare_system/social_assistance_payments/residency_requirements_for_social_assistance_in_ireland.html.txt.tmx
Source language: en
Languages: pl

source: Residence requirements for social assistance in Ireland
pl: Wymogi dotyczące pobytu potrzebne dla uzyskania pomocy społecznej w Irlandii

source: The social welfare system in Ireland is divided into three main types of payments
pl: System opieki społecznej w Irlandii dzieli się na trzy podstawowe rodzaje zasiłkow

source: • Social insurance payments: (for example, Jobseeker's Benefit)
pl: • Zasiłki z opieki społecznej: (na przykład, zasiłek na poszukiwanie pracy ; Jobseeker's Benefit)

source: • Means-tested payments or social assistance payments: (for example, Jobseeker's Allowance)
pl: • Wypłaty kwalifikowane bądź wypłaty zasiłków z opieki społecznej: (na przykład, dodatek na poszukiwanie pracy Jobseeker's Allowance)

source: • Universal payments: (for example, Child Benefit)
pl: • Wypłaty powszechne: (na przykład, zasiłek na dziecko (Child Benefit)

source: With all social welfare payments in Ireland, you must satisfy the rules for each scheme to qualify
pl: W odniesieniu do wszelkich wypłat z opieki społecznej w Irlandii, aby zostać do nich zakwalifikowanym, konieczne jest spełnienie w każdym przypadku odpowiednich warunków

source: You must also be habitually resident in Ireland to qualify for the following payments:
pl: Aby zostać zakwalifikowanym do otrzymania następujących zasiłków, niezbędne jest także, aby być stałym mieszkańcem Irlandii:

source: • Back to Work Family Dividend • Blind Pension
pl: • Renta dla osoby niewidomej

source: • Child Benefit • Domiciliary Care Allowance
pl: • Dodatkowy zasiłek z opieki społecznej

source: • Guardian's Payment (Non-Contributory) • Family Income Supplement (HRC does not apply to FIS)
pl: • Renta wdowia bądź renta dla partnera żyjącego (nieskładkowa)

source: • EEA/EU citizens who are currently employed or self-employed here (or who are getting Jobseeker's Benefit or any other benefit which derives from their employment such as Maternity Benefit, Illness Benefit or Occupational Injuries Benefit) • Non-EEA nationals, who have previously worked in another EEA State, and are currently legally employed or self-employed here You can read more about Exemption from the HRC for Family Benefits on welfare.ie
pl: Twój współmałżonek, parter cywilny, konkubent lub konkubina oraz wszystkie twoje dzieci pozostające na utrzymaniu nie muszą sami spełniać warunku stałego zamieszkania, więc jeśli to ty składasz podanie o świadczenie pomocy społecznej dla siebie, wtedy tylko ty - petent, musisz spełniać warunek stałego zamieszkania

source: To be considered an EU migrant worker you must have been in genuine employment (not casual work) since coming to Ireland
pl: Ministerstwo Opieki Społecznej opublikowało obszerne Wytyczne postępowania w warunkach stałego zameldowania

source: Changes to HRC in 2014
pl: Zmiany odnośnie warunku stałego zamieszkania z roku 2014

source: You must be habitually resident in the State on the date you make the application and you must remain habitually resident in the State after you apply
pl: W dniu złożenia podania i w okresie po jego złożeniu musisz spełniać warunek stałego zamieszkania w Irlandii

source: This provision was added by the Social Welfare and Pensions Act 2014, which came into force on 17 July 2014
pl: Przepis ten dodany został w wyniku wejścia w życie Ustawy o pomocy społecznej i emeryturach z 2014 roku

source: Before this, the habitual residence condition (HRC) could only be examined on the date of application
pl: Przedtem warunek stałego zamieszkania mógł być jedynie sprawdzany na dzień złożenia podania

source: Since 17 July 2014, the HRC decision on your case may be reviewed if any relevant circumstances change (for example, if you lose the right to reside) or if you were absent from the State for a significant period of time
pl: Od 17 lipca 2014 decyzja ws. warunku stałego zamieszkania w twojej sprawie może zostać rozpatrzona w dowolnym momencie zmiany warunków życia (np. gdy utracisz prawo zamieszkiwania) lub gdy pozostajesz poza granicami Kraju przez znaczny okres czasu

source: What is habitual residence?
pl: Co to jest zamieszkanie stałe?

source: The term "habitually resident" is not defined in Irish law
pl: Irlandzkie prawo nie definiuje terminu "stały mieszkaniec"

source: In practice it means that you have a proven close link to Ireland
pl: W praktyce oznacza on, że możecie udowodnić bliskie powiązanie z Irlandią

source: The term also conveys permanence - that a person has been here for some time and intends to stay here for the foreseeable future
pl: Termin podkreśla także stałość – mianowicie, że osoba przebywa tu już od jakiegoś czasu i ma zamiar pozostać w dającej się przewidzieć przyszłości

source: Proving you are habitually resident relies heavily on fact
pl: Udowodnienie, że jest się stałym mieszkańcem, opiera się głównie na faktach

source: If you have lived in Ireland all your life, you will probably have no difficulty showing that you satisfy the factors which indicate habitual residence – see list below
pl: Jeżeli przez całe życie mieszkacie w Irlandii, prawdopodobnie bez trudności udowodnicie, że spełniacie warunki określające stałe zamieszkanie – patrz poniższy wykaz

source: Who decides whether an applicant is habitually resident?
pl: Kto decyduje o tym, czy wnioskodawca jest stałym mieszkańcem?

source: Statutorily appointed Deciding Officers (or Determining Officers in the case of Supplementary Welfare Allowance) determine whether you meet the requirement to be habitually resident in the State
pl: Ustawowo wyznaczeni urzędnicy decyzyjni (lub urzędnicy podejmujący decyzję w sprawach o zasiłek dodatkowy z opieki społecznej) mają prawo uznania, czy spełniacie warunki, aby uznać was za stałego mieszkańca Państwa

source: The Officer will rely on the evidence you provide and be guided by national and EU law and guidelines when making their decision
pl: Urzędnik będzie opierać się na dowodach przez was dostarczonych i przy podejmowaniu decyzji, kierować się będzie prawami państwowymi i unijnymi

source: When the Officer makes a decision on whether a person is habitually resident they must follow a series of steps:
pl: Kiedy urzędnik ma podjąć decyzję w kwestii uznania, czy dana osoba jest stałym mieszkańcem, musi wykonać serię działań:

source: Check whether you are a person who is not regarded as being habitually resident in the State
pl: Sprawdzić, czy nie jesteście osobą, która nie jest uważana za stałego mieszkańca Państwa

source: For example, asylum seekers are not regarded as habitually resident
pl: Na przykład, osoby starające się o azyl, nie są uważane za stałych mieszkańców

source: You can find out more about who is not regarded as habitually resident in Appendix 3 of the Operational Guidelines
pl: Więcej na temat, kto nie jest postrzegany, jako stały mieszkaniec, znajdziecie w Załączniku 3 Wytycznych Postępowania

source: Check whether you are exempt from the habitual residence condition
pl: Sprawdzić, czy nie stanowicie wyjątku od reguł dotyczących stałego zamieszkania

source: Certain people, in particular EEA nationals who are considered migrant workers, are exempt from the habitual residence condition (see also Exemption from the habitual residence condition above)
pl: Określone osoby, w szczególności członkowie Europejskiego Obszaru Gospodarczego (EEA), którzy uważani są za pracowników wędrownych, wyłączeni są z obowiązku wykazania się spełnieniem warunków stałego zamieszkania (patrz także poniżej Wyjątki z obowiązku spełnienia warunków zamieszkania przez obywateli Europejskiego Obszaru Gospodarczego - EEA)

source: You can find out more about who is exempt from the habitual residence condition in Section 3 of the Operational Guidelines
pl: Więcej informacji na temat kto jest zwolniony od spełnienia warunków stałego zamieszkania znajduje się w Rozdziale 3 Wytycznych Postępowania

source: Check whether a previous habitual residence decision has been given or if the case is under appeal
pl: Sprawdzić, czy uprzednio wydana została decyzja odnośnie stałego zamieszkania lub czy nie została wniesiona apelacja

source: A previous decision on habitual residence should carry through to subsequent claims unless there has been a significant change in circumstances since a new application was made
pl: Wcześniejsza decyzja dotycząca stałego zamieszkania winna prowadzić do kolejnego rozstrzygnięcia, chyba że po złożeniu kolejnego wniosku, nastąpiły istotne zmiany okoliczności

source: Consider whether the person has a right to reside in the State
pl: Rozważyć problem, czy dana osoba ma prawo zamieszkiwać w Państwie

source: If you do not have a legal right of residence in this State, you will not be regarded as habitually resident
pl: Jeśli nie posiadacie legalnego prawa do zamieszkiwania w tym Państwie, nie zostaniecie uznani za stałego mieszkańca

source: The following groups of people have a right to reside in Ireland:
pl: Następująca grupa ludzi posiada prawo do zamieszkiwania w Irlandii:

source: • UK nationals from the Common Travel Area (CTA)
pl: • Obywatele Zjednoczonego Królestwa ze Wspólnego Obszaru Podróży (CTA)

source: • EEA nationals who are employed or self-employed in Ireland
pl: • Pracownicy Europejskiego Obszaru Gospodarczego (EEA), zatrudnieni w Irlandii, bądź pracujący tu na własny rachunek

source: • EEA nationals who have been employed here for over a year and are now unemployed, provided they are registered as jobseekers with the Department of Social Protection
pl: • Pracownicy Europejskiego Obszaru Gospodarczego, którzy byli tu zatrudnieni przez okres dłuższy niż jeden rok, a teraz są bezrobotni, pod warunkiem zarejestrowania jako osoby poszukujące pracy, w Departamencie Opieki Społecznej

source: • EEA nationals, who have been employed here for less than a year and are now unemployed, may stay for another 6 months provided they are registered as jobseekers with the Department of Social Protection
pl: • Pracownicy Europejskiego Obszaru Gospodarczego, zatrudnieni tutaj przez okres krótszy niż jeden rok, a obecnie bezrobotni, mogą pozostać w Irlandii przez kolejne 6 miesięcy, pod warunkiem zarejestrowania ich jako osoby poszukujące pracy, w Departamencie Opieki Społecznej

source: • EEA nationals who can support themselves, their spouse/civil partner and any accompanying dependents and who have comprehensive sickness insurance
pl: • Pracownicy Europejskiego Obszaru Gospodarczego, którzy potrafią się sami utrzymać, a także swojego współmałżonka/partnera oraz osoby towarzyszące, pozostające na ich utrzymaniu i którzy posiadają pełne ubezpieczenie zdrowotne

source: • EEA nationals who are visitors or jobseekers can stay for up to 3 months provided that they do not become a burden on the social welfare system of the State during that period (as determined by the Department of Justice - SI 656 of 2006 (pdf))
pl: • Pracownicy Europejskiego Obszaru Gospodarczego, którzy są gośćmi bądź poszukują pracy mogą przebywać do 3 miesięcy, pod warunkiem, że w okresie tym nie staną się obciążeniem państwowego systemu opieki społecznej

source: • Non-EEA nationals with an employment permit that allows them to legally reside and work in the State
pl: • Obywatele nie pochodzący z Europejskiego Obszaru Gospodarczego (EEA), posiadający zezwolenie na pobyt bądź pracę, umożliwiające im legalne przebywanie i pracę w Państwie

source: A person with permission to reside will have the appropriate immigration stamp in their passport and a Certificate of Registration issued by the Garda National Immigration Bureau (GNIB) (a GNIB card)
pl: Osoba, posiadajaca zezwolenie na pobyt, ma w paszporcie odpowiednią pieczęć imigracyjną oraz Certyfikat Rejestracji, wydany przez Państwowe Biuro Imigracyjne Garda (Garda National Immigration Bureau - GNIB) (karta GNIB)

source: • Asylum seekers who have been granted permission to remain
pl: • Osoby zwracające się o azyl, którym przyznano zezwolenie na pobyt

source: The resident spouse or civil partner and/or dependants of a person with refugee status or of a non-EEA national with an employment permit normally hold the same habitual residence status as that of the sponsor
pl: Współmałżonek lub partner oraz/lub osoby zależne od osoby posiadającej status uchodźcy bądź obywatela państwa nie należącego do Europejskiego Obszaru Gospodarczego z zezwoleniem na zatrudnienie, zwyczajowo otrzymują taki sam status pobytowy, jak sponsor

source: These family members should be treated as habitually resident as long as they and the sponsor retain permission to be in the State
pl: Członkowie takiej rodziny winni być traktowani jako stali mieszkańcy tak długo, jak pozostaje w mocy ich i sponsora zezwolenie na pobyt w Państwie

source: Examine the 5 factors to determine habitual residence
pl: W celu dokonania oceny stałego zamieszkania, przeanalizować należy 5 czynników

source: Once your right to reside has been established the following 5 factors (which have been set down in Irish and European law) are examined to find out if you are habitually resident in Ireland:
pl: Jeżeli ustalone zostało wasze prawo do zamieszkania, należy przeanalizować 5 następujących czynników (zapisanych w prawie irlandzkim i europejskim) w celu stwierdzenia, czy jesteście stałym mieszkańcem Irlandii:

source: • Length and continuity of residence in Ireland
pl: • Długość i ciągłość zamieszkiwania w Irlandii

source: • Length and purpose of any absence from Ireland
pl: • Długość i powód każdej nieobecności w Irlandii

source: • Nature and pattern of employment
pl: • Charakter i rodzaj zatrudnienia

source: • Your main centre of interest
pl: • Wasz główny punkt zainteresowania

source: • Your future intentions to live in Ireland as it appears from the evidence
pl: • Na podstawie dowodów, wasze przyszłe zamiary mieszkania w Irlandii

source: You can find out more about the 5 factors in the Operational Guidelines on the Department of Social Protection's website
pl: Więcej informacji na temat 5 czynników w Wytycznych Operacyjnych, znajdziecie na stronie internetowej Departamentu Opieki Społecznej

source: The Department of Social Protection has also published a supplement to the Guidelines with scenarios which show how the habitual residence condition is applied in practice
pl: Departament Opieki Społecznej opublikował także suplement do Wytycznych, zawierający scenariusze ukazujące zastosowanie w praktyce warunków stałego zamieszkania

source: EU rules prevent discrimination on nationality grounds in relation to social security, so it is not possible to exempt a particular category of Irish citizens (such as returning Irish emigrants) from the habitual residence condition (either in general or for Carer’s Allowance) without extending the same treatment to all EU nationals
pl: Jeżeli jesteście obywatelami Europejskiego Obszaru Gospodarczego i można was uznać za wędrownego pracownika UE, może przysługiwać wam dodatkowy zasiłek z opieki społecznej (SWA). Aby zostać uznanym za wędrownego pracownika UE, musicie posiadać prawidłowe zatrudnienie (nie pracę sezonową) od momentu przybycia do Irlandii

source: However, the guidelines on determination of habitual residence address the issue of returning emigrants very specifically
pl: Niemniej jednak, wytyczne dotyczące określenia adresu stałego zamieszkania, kwestię powracających emigrantów traktują bardzo specyficznie

source: The guidelines state: “A person who had previously been habitually resident in the State and who moved to live and work in another country and then resumes his/her long-term residence in the State may be regarded as being habitually resident immediately on his/her return to the State.”
pl: Wytyczne stanowią: “Osoba, która uprzednio była stałym mieszkańcem Państwa i która wyprowadziła się w celu zamieszkania i pracy do innego Państwa, a następnie podejmuje swoje stałe zamieszkanie na długi okres czasu w Państwie, może zostać uznana za stałego mieszkańca bezpośrednio po jego/jej powrocie do Państwa”

source: When determining the main centre of interest for returning emigrants, Deciding Officers take account of:
pl: Przy ocenianiu podstawowych zamiarów emigrantów powracających, urzędnicy decyzyjni biorą pod uwagę:

source: • The purpose of your return, for example, because your foreign residence permit has expired
pl: • Przyczynę powrotu, na przykład wasze zagraniczne zezwolenie na pobyt wygasło

source: • Verified arrangements which you have made in regard to returning on a long-term basis, for example, transfer of financial accounts and any other assets, termination of residence-based entitlements in the other country, or assistance from Safe-Home or a similar programme to enable Irish emigrants to return permanently
pl: • Zweryfikowanie przygotowań, jakich dokonaliście w związku z powrotem na długi okres czasu, na przykład, transfer kont finansowych i innych aktywów, zamknięcie zezwoleń związanych z zamieszkaniem w tamtym kraju, czy też skorzystanie z pomocy Safe-Home lub podobnego programu, umożliwiającego emigrantom irlandzkim powrót na stałe

source: • Length and continuity of your previous residence in the State
pl: • Długość i ciągłość waszego uprzedniego zamieszkiwania w Państwie

source: • Your record of employment or self employment in another state and
pl: • Historia zatrudnienia bądź praca na własny rachunek w innym kraju oraz

source: • Whether you have maintained links with your previous residence and can be regarded as resuming your previous residence rather than starting a new period of residence
pl: • Czy utrzymaliście związki z waszym uprzednim zamieszkaniem i można je uznać za ponowne zamieszkanie w poprzednim miejscu, czy też raczej rozpoczynacie nowy okres w innym miejscu zamieszkania

source: If the DSP needs more information to decide whether you are habitually resident in the Republic of Ireland you may be asked to fill out the HRC1 form (pdf)
pl: W przypadku gdy Ministerstwo Opieki Społecznej potrzebuje więcej informacji w celu określenia, czy zamieszkujesz w republice Irlandii na stałe, możesz zostać poproszony o wypełnienie formularza HRC1 (pdf)

source: Regardless of what country you are coming from you may be asked to provide documentary evidence that shows your 'centre of interest' is now in Ireland
pl: Niezależnie od tego, z jakiego kraju przybywacie, możecie zostać wezwani do przedstawienia dowodu z dokumentu, który wykaże, że wasze ‘centrum zainteresowania’ znajduje się teraz w Irlandii

source: This evidence should show that you have moved to Ireland, you intend to settle in Ireland permanently and you do not intend to go back to live in the country you came from
pl: Dowód ten winien wykazać, ze przeprowadziliście się do Irlandii, macie zamiar osiedlić się w Irlandii na stałe i nie macie zamiaru powracać do kraju, z którego przybywacie, aby tam zamieszkać

source: Where possible, you should provide the following documentary evidence:
pl: Jeżeli to możliwe, należy przedstawić następujące dowody z dokumentów:

source: • Proof to show you have given up accommodation abroad
pl: • Dowód ukazujący, że zrezygnowaliście z praw mieszkaniowych za granicą

source: • Proof that you have cancelled or applied to cancel any non-transferable benefits
pl: • Udowodnić, że skasowaliście bądź przekazaliście wszelkie korzyści nie nadające się do przetransferowania

source: • Proof you have transferred or applied to transfer any transferable income
pl: • Udowodnić, że przetransferowaliście lub zorganizowaliście transfer wszelkich dochodów, jakie można przekazać

source: • Proof to show measures you have put in place to open a bank account here
pl: • Udowodnić, jakie kroki podjęliście na miejscu, aby otworzyć tu rachunek bankowy

source: • Proof to show you have a tenancy in your own name (in Ireland)
pl: • Udowodnić, przedstawiając dowód, że posiadacie prawa lokatorskie na swoje własne nazwisko (w Irlandii)

source: • Proof of travel documents including, where relevant, excess baggage fees and removal/shipping receipts
pl: • Dowód z dokumentów podróżnych, w tym, gdzie dotyczy, okazać opłaty za nadbagaż oraz pokwitowania odbioru/nadania

source: All evidence presented will be authenticated, as far as is possible, by the relevant Officer
pl: Tam, gdzie to możliwe, wszelkie przedstawione dowody muszą być poświadczone przez właściwego urzędnika

source: In some cases you may be asked to submit further documentary evidence
pl: W niektórych przypadkach możecie zostać poproszeni o dostarczenie dodatkowego dowodu z dokumentu

source: In certain cases, a Social Welfare Inspector may investigate your application
pl: W określonych przypadkach, wasz wniosek może zostać poddany badaniu przez inspektora opieki społecznej

source: Appealing a decision on habitual residency
pl: Odwołanie od decyzji dotyczącej stałego zamieszkania

source: If you are not satisfied with the decision made in your case you have the right of review and/or the right of appeal
pl: Jeżeli nie zgadzacie się z postanowieniem decyzyjnego urzędnika, przysługuje wam prawo do rewizji i/lub prawo do odwołania

source: If you wish to have your case reviewed you can submit additional evidence and ask for the decision to be reviewed
pl: Jeżeli chcecie, aby wasza sprawa została poddana rewizji, możecie przedłożyć kolejny dowód i poprosić o ponowne rozpatrzenie postanowienia

source: You can also bring an appeal against the decision to the independent Social Welfare Appeals Office
pl: Możecie także wnieść apelację od decyzji do niezależnego Biura Odwoławczego Opieki Społecznej
